
Класс персон(метакласс):

Инит содержит словарик со всеми людьми.
Есть переменные возраст, и номер курса

Функция добавить человека добавляет его через ключ:значение

Фенкция вывести всех людей.

Абстрактная функция врайт.



Дочерний класс учитель:
Здесь есть параметр стаж учителя

реализована функция врайт, которая записывает в инит всё что там есть
и дополнительно стаж учителя


Дочерний класс ученики:
Содержит параметр год поступления

Так же реализзована функция  врайт, которая записывает всё в инит и доп.
инфо о годе поступления
