Класс - Курсы
Содержит список списков "Курсы"
Функция добавить список в список списков.
Функция вернуть список списков
Функция вернуть список из списка списков

Класс - персон(Курсы):
Инит содержит словарик именем человека и данными о нем.
В ините реализована if которая определяет есть ли заданный курс человека
в списке курсов, если есть, то добавляет в указанный список имя человека.
Если нету, то выдает исключение.
Есть переменные возраст.
Функция добавить человека добавляет его через ключ:значение
Функция вывести человека через его имя
Абстрактная функция врайт и рид



Класс - учитель(персон):
Здесь есть параметр стаж учителя
Функция врайт: записывает в инит: возраст, стаж учителя, курс



Класс - ученики(персон):
Содержит параметр год поступления
Функция врайт: записывает в инит возраст, год поступления, курс
